GopalSaraf/Practicals/PSDL/include/proc/pic16lf1508.inc
// Register: CWG1CON0
#define CWG1CON0 CWG1CON0
CWG1CON0                                 equ 0693h
// bitfield definitions
CWG1CON0_G1CS0_POSN                      equ 0000h
CWG1CON0_G1CS0_POSITION                  equ 0000h
CWG1CON0_G1CS0_SIZE                      equ 0001h
CWG1CON0_G1CS0_LENGTH                    equ 0001h
CWG1CON0_G1CS0_MASK                      equ 0001h
CWG1CON0_G1POLA_POSN                     equ 0003h
CWG1CON0_G1POLA_POSITION                 equ 0003h
CWG1CON0_G1POLA_SIZE                     equ 0001h
CWG1CON0_G1POLA_LENGTH                   equ 0001h
CWG1CON0_G1POLA_MASK                     equ 0008h
CWG1CON0_G1POLB_POSN                     equ 0004h
CWG1CON0_G1POLB_POSITION                 equ 0004h
CWG1CON0_G1POLB_SIZE                     equ 0001h
CWG1CON0_G1POLB_LENGTH                   equ 0001h
CWG1CON0_G1POLB_MASK                     equ 0010h
CWG1CON0_G1OEA_POSN                      equ 0005h
CWG1CON0_G1OEA_POSITION                  equ 0005h
CWG1CON0_G1OEA_SIZE                      equ 0001h
CWG1CON0_G1OEA_LENGTH                    equ 0001h
CWG1CON0_G1OEA_MASK                      equ 0020h
CWG1CON0_G1OEB_POSN                      equ 0006h
CWG1CON0_G1OEB_POSITION                  equ 0006h
CWG1CON0_G1OEB_SIZE                      equ 0001h
CWG1CON0_G1OEB_LENGTH                    equ 0001h
CWG1CON0_G1OEB_MASK                      equ 0040h
CWG1CON0_G1EN_POSN                       equ 0007h
CWG1CON0_G1EN_POSITION                   equ 0007h
CWG1CON0_G1EN_SIZE                       equ 0001h
CWG1CON0_G1EN_LENGTH                     equ 0001h
CWG1CON0_G1EN_MASK                       equ 0080h
CWG1CON0_G1CS_POSN                       equ 0000h
CWG1CON0_G1CS_POSITION                   equ 0000h
CWG1CON0_G1CS_SIZE                       equ 0002h
CWG1CON0_G1CS_LENGTH                     equ 0002h
CWG1CON0_G1CS_MASK                       equ 0003h

// Register: CWG1CON1
#define CWG1CON1 CWG1CON1
CWG1CON1                                 equ 0694h
// bitfield definitions
CWG1CON1_G1IS0_POSN                      equ 0000h
CWG1CON1_G1IS0_POSITION                  equ 0000h
CWG1CON1_G1IS0_SIZE                      equ 0001h
CWG1CON1_G1IS0_LENGTH                    equ 0001h
CWG1CON1_G1IS0_MASK                      equ 0001h
CWG1CON1_G1IS1_POSN                      equ 0001h
CWG1CON1_G1IS1_POSITION                  equ 0001h
CWG1CON1_G1IS1_SIZE                      equ 0001h
CWG1CON1_G1IS1_LENGTH                    equ 0001h
CWG1CON1_G1IS1_MASK                      equ 0002h
CWG1CON1_G1IS2_POSN                      equ 0002h
CWG1CON1_G1IS2_POSITION                  equ 0002h
CWG1CON1_G1IS2_SIZE                      equ 0001h
CWG1CON1_G1IS2_LENGTH                    equ 0001h
CWG1CON1_G1IS2_MASK                      equ 0004h
CWG1CON1_G1ASDLA_POSN                    equ 0004h
CWG1CON1_G1ASDLA_POSITION                equ 0004h
CWG1CON1_G1ASDLA_SIZE                    equ 0002h
CWG1CON1_G1ASDLA_LENGTH                  equ 0002h
CWG1CON1_G1ASDLA_MASK                    equ 0030h
CWG1CON1_G1ASDLB_POSN                    equ 0006h
CWG1CON1_G1ASDLB_POSITION                equ 0006h
CWG1CON1_G1ASDLB_SIZE                    equ 0002h
CWG1CON1_G1ASDLB_LENGTH                  equ 0002h
CWG1CON1_G1ASDLB_MASK                    equ 00C0h
CWG1CON1_G1IS_POSN                       equ 0000h
CWG1CON1_G1IS_POSITION                   equ 0000h
CWG1CON1_G1IS_SIZE                       equ 0004h
CWG1CON1_G1IS_LENGTH                     equ 0004h
CWG1CON1_G1IS_MASK                       equ 000Fh
CWG1CON1_G1ASDLA0_POSN                   equ 0004h
CWG1CON1_G1ASDLA0_POSITION               equ 0004h
CWG1CON1_G1ASDLA0_SIZE                   equ 0001h
CWG1CON1_G1ASDLA0_LENGTH                 equ 0001h
CWG1CON1_G1ASDLA0_MASK                   equ 0010h
CWG1CON1_G1ASDLA1_POSN                   equ 0005h
CWG1CON1_G1ASDLA1_POSITION               equ 0005h
CWG1CON1_G1ASDLA1_SIZE                   equ 0001h
CWG1CON1_G1ASDLA1_LENGTH                 equ 0001h
CWG1CON1_G1ASDLA1_MASK                   equ 0020h
CWG1CON1_G1ASDLB0_POSN                   equ 0006h
CWG1CON1_G1ASDLB0_POSITION               equ 0006h
CWG1CON1_G1ASDLB0_SIZE                   equ 0001h
CWG1CON1_G1ASDLB0_LENGTH                 equ 0001h
CWG1CON1_G1ASDLB0_MASK                   equ 0040h
CWG1CON1_G1ASDLB1_POSN                   equ 0007h
CWG1CON1_G1ASDLB1_POSITION               equ 0007h
CWG1CON1_G1ASDLB1_SIZE                   equ 0001h
CWG1CON1_G1ASDLB1_LENGTH                 equ 0001h
CWG1CON1_G1ASDLB1_MASK                   equ 0080h

// Register: CWG1CON2
#define CWG1CON2 CWG1CON2
CWG1CON2                                 equ 0695h
// bitfield definitions
CWG1CON2_G1ASDSCLC2_POSN                 equ 0000h
CWG1CON2_G1ASDSCLC2_POSITION             equ 0000h
CWG1CON2_G1ASDSCLC2_SIZE                 equ 0001h
CWG1CON2_G1ASDSCLC2_LENGTH               equ 0001h
CWG1CON2_G1ASDSCLC2_MASK                 equ 0001h
CWG1CON2_G1ASDSFLT_POSN                  equ 0001h
CWG1CON2_G1ASDSFLT_POSITION              equ 0001h
CWG1CON2_G1ASDSFLT_SIZE                  equ 0001h
CWG1CON2_G1ASDSFLT_LENGTH                equ 0001h
CWG1CON2_G1ASDSFLT_MASK                  equ 0002h
CWG1CON2_G1ASDSC1_POSN                   equ 0002h
CWG1CON2_G1ASDSC1_POSITION               equ 0002h
CWG1CON2_G1ASDSC1_SIZE                   equ 0001h
CWG1CON2_G1ASDSC1_LENGTH                 equ 0001h
CWG1CON2_G1ASDSC1_MASK                   equ 0004h
CWG1CON2_G1ASDSC2_POSN                   equ 0003h
CWG1CON2_G1ASDSC2_POSITION               equ 0003h
CWG1CON2_G1ASDSC2_SIZE                   equ 0001h
CWG1CON2_G1ASDSC2_LENGTH                 equ 0001h
CWG1CON2_G1ASDSC2_MASK                   equ 0008h
CWG1CON2_G1ARSEN_POSN                    equ 0006h
CWG1CON2_G1ARSEN_POSITION                equ 0006h
CWG1CON2_G1ARSEN_SIZE                    equ 0001h
CWG1CON2_G1ARSEN_LENGTH                  equ 0001h
CWG1CON2_G1ARSEN_MASK                    equ 0040h
CWG1CON2_G1ASE_POSN                      equ 0007h
CWG1CON2_G1ASE_POSITION                  equ 0007h
CWG1CON2_G1ASE_SIZE                      equ 0001h
CWG1CON2_G1ASE_LENGTH                    equ 0001h
CWG1CON2_G1ASE_MASK                      equ 0080h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 0F0Fh
// bitfield definitions
CLCDATA_MCLC1OUT_POSN                    equ 0000h
CLCDATA_MCLC1OUT_POSITION                equ 0000h
CLCDATA_MCLC1OUT_SIZE                    equ 0001h
CLCDATA_MCLC1OUT_LENGTH                  equ 0001h
CLCDATA_MCLC1OUT_MASK                    equ 0001h
CLCDATA_MCLC2OUT_POSN                    equ 0001h
CLCDATA_MCLC2OUT_POSITION                equ 0001h
CLCDATA_MCLC2OUT_SIZE                    equ 0001h
CLCDATA_MCLC2OUT_LENGTH                  equ 0001h
CLCDATA_MCLC2OUT_MASK                    equ 0002h
CLCDATA_MCLC3OUT_POSN                    equ 0002h
CLCDATA_MCLC3OUT_POSITION                equ 0002h
CLCDATA_MCLC3OUT_SIZE                    equ 0001h
CLCDATA_MCLC3OUT_LENGTH                  equ 0001h
CLCDATA_MCLC3OUT_MASK                    equ 0004h
CLCDATA_MCLC4OUT_POSN                    equ 0003h
CLCDATA_MCLC4OUT_POSITION                equ 0003h
CLCDATA_MCLC4OUT_SIZE                    equ 0001h
CLCDATA_MCLC4OUT_LENGTH                  equ 0001h
CLCDATA_MCLC4OUT_MASK                    equ 0008h

