GopalSaraf/Practicals/PSDL/include/proc/pic16lf1508.inc
// Register: CLC2GLS2
#define CLC2GLS2 CLC2GLS2
CLC2GLS2                                 equ 0F1Eh
// bitfield definitions
CLC2GLS2_LC2G3D1N_POSN                   equ 0000h
CLC2GLS2_LC2G3D1N_POSITION               equ 0000h
CLC2GLS2_LC2G3D1N_SIZE                   equ 0001h
CLC2GLS2_LC2G3D1N_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D1N_MASK                   equ 0001h
CLC2GLS2_LC2G3D1T_POSN                   equ 0001h
CLC2GLS2_LC2G3D1T_POSITION               equ 0001h
CLC2GLS2_LC2G3D1T_SIZE                   equ 0001h
CLC2GLS2_LC2G3D1T_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D1T_MASK                   equ 0002h
CLC2GLS2_LC2G3D2N_POSN                   equ 0002h
CLC2GLS2_LC2G3D2N_POSITION               equ 0002h
CLC2GLS2_LC2G3D2N_SIZE                   equ 0001h
CLC2GLS2_LC2G3D2N_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D2N_MASK                   equ 0004h
CLC2GLS2_LC2G3D2T_POSN                   equ 0003h
CLC2GLS2_LC2G3D2T_POSITION               equ 0003h
CLC2GLS2_LC2G3D2T_SIZE                   equ 0001h
CLC2GLS2_LC2G3D2T_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D2T_MASK                   equ 0008h
CLC2GLS2_LC2G3D3N_POSN                   equ 0004h
CLC2GLS2_LC2G3D3N_POSITION               equ 0004h
CLC2GLS2_LC2G3D3N_SIZE                   equ 0001h
CLC2GLS2_LC2G3D3N_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D3N_MASK                   equ 0010h
CLC2GLS2_LC2G3D3T_POSN                   equ 0005h
CLC2GLS2_LC2G3D3T_POSITION               equ 0005h
CLC2GLS2_LC2G3D3T_SIZE                   equ 0001h
CLC2GLS2_LC2G3D3T_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D3T_MASK                   equ 0020h
CLC2GLS2_LC2G3D4N_POSN                   equ 0006h
CLC2GLS2_LC2G3D4N_POSITION               equ 0006h
CLC2GLS2_LC2G3D4N_SIZE                   equ 0001h
CLC2GLS2_LC2G3D4N_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D4N_MASK                   equ 0040h
CLC2GLS2_LC2G3D4T_POSN                   equ 0007h
CLC2GLS2_LC2G3D4T_POSITION               equ 0007h
CLC2GLS2_LC2G3D4T_SIZE                   equ 0001h
CLC2GLS2_LC2G3D4T_LENGTH                 equ 0001h
CLC2GLS2_LC2G3D4T_MASK                   equ 0080h
CLC2GLS2_D1N_POSN                        equ 0000h
CLC2GLS2_D1N_POSITION                    equ 0000h
CLC2GLS2_D1N_SIZE                        equ 0001h
CLC2GLS2_D1N_LENGTH                      equ 0001h
CLC2GLS2_D1N_MASK                        equ 0001h
CLC2GLS2_D1T_POSN                        equ 0001h
CLC2GLS2_D1T_POSITION                    equ 0001h
CLC2GLS2_D1T_SIZE                        equ 0001h
CLC2GLS2_D1T_LENGTH                      equ 0001h
CLC2GLS2_D1T_MASK                        equ 0002h
CLC2GLS2_D2N_POSN                        equ 0002h
CLC2GLS2_D2N_POSITION                    equ 0002h
CLC2GLS2_D2N_SIZE                        equ 0001h
CLC2GLS2_D2N_LENGTH                      equ 0001h
CLC2GLS2_D2N_MASK                        equ 0004h
CLC2GLS2_D2T_POSN                        equ 0003h
CLC2GLS2_D2T_POSITION                    equ 0003h
CLC2GLS2_D2T_SIZE                        equ 0001h
CLC2GLS2_D2T_LENGTH                      equ 0001h
CLC2GLS2_D2T_MASK                        equ 0008h
CLC2GLS2_D3N_POSN                        equ 0004h
CLC2GLS2_D3N_POSITION                    equ 0004h
CLC2GLS2_D3N_SIZE                        equ 0001h
CLC2GLS2_D3N_LENGTH                      equ 0001h
CLC2GLS2_D3N_MASK                        equ 0010h
CLC2GLS2_D3T_POSN                        equ 0005h
CLC2GLS2_D3T_POSITION                    equ 0005h
CLC2GLS2_D3T_SIZE                        equ 0001h
CLC2GLS2_D3T_LENGTH                      equ 0001h
CLC2GLS2_D3T_MASK                        equ 0020h
CLC2GLS2_D4N_POSN                        equ 0006h
CLC2GLS2_D4N_POSITION                    equ 0006h
CLC2GLS2_D4N_SIZE                        equ 0001h
CLC2GLS2_D4N_LENGTH                      equ 0001h
CLC2GLS2_D4N_MASK                        equ 0040h
CLC2GLS2_D4T_POSN                        equ 0007h
CLC2GLS2_D4T_POSITION                    equ 0007h
CLC2GLS2_D4T_SIZE                        equ 0001h
CLC2GLS2_D4T_LENGTH                      equ 0001h
CLC2GLS2_D4T_MASK                        equ 0080h

// Register: CLC2GLS3
#define CLC2GLS3 CLC2GLS3
CLC2GLS3                                 equ 0F1Fh
// bitfield definitions
CLC2GLS3_LC2G4D1N_POSN                   equ 0000h
CLC2GLS3_LC2G4D1N_POSITION               equ 0000h
CLC2GLS3_LC2G4D1N_SIZE                   equ 0001h
CLC2GLS3_LC2G4D1N_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D1N_MASK                   equ 0001h
CLC2GLS3_LC2G4D1T_POSN                   equ 0001h
CLC2GLS3_LC2G4D1T_POSITION               equ 0001h
CLC2GLS3_LC2G4D1T_SIZE                   equ 0001h
CLC2GLS3_LC2G4D1T_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D1T_MASK                   equ 0002h
CLC2GLS3_LC2G4D2N_POSN                   equ 0002h
CLC2GLS3_LC2G4D2N_POSITION               equ 0002h
CLC2GLS3_LC2G4D2N_SIZE                   equ 0001h
CLC2GLS3_LC2G4D2N_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D2N_MASK                   equ 0004h
CLC2GLS3_LC2G4D2T_POSN                   equ 0003h
CLC2GLS3_LC2G4D2T_POSITION               equ 0003h
CLC2GLS3_LC2G4D2T_SIZE                   equ 0001h
CLC2GLS3_LC2G4D2T_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D2T_MASK                   equ 0008h
CLC2GLS3_LC2G4D3N_POSN                   equ 0004h
CLC2GLS3_LC2G4D3N_POSITION               equ 0004h
CLC2GLS3_LC2G4D3N_SIZE                   equ 0001h
CLC2GLS3_LC2G4D3N_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D3N_MASK                   equ 0010h
CLC2GLS3_LC2G4D3T_POSN                   equ 0005h
CLC2GLS3_LC2G4D3T_POSITION               equ 0005h
CLC2GLS3_LC2G4D3T_SIZE                   equ 0001h
CLC2GLS3_LC2G4D3T_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D3T_MASK                   equ 0020h
CLC2GLS3_LC2G4D4N_POSN                   equ 0006h
CLC2GLS3_LC2G4D4N_POSITION               equ 0006h
CLC2GLS3_LC2G4D4N_SIZE                   equ 0001h
CLC2GLS3_LC2G4D4N_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D4N_MASK                   equ 0040h
CLC2GLS3_LC2G4D4T_POSN                   equ 0007h
CLC2GLS3_LC2G4D4T_POSITION               equ 0007h
CLC2GLS3_LC2G4D4T_SIZE                   equ 0001h
CLC2GLS3_LC2G4D4T_LENGTH                 equ 0001h
CLC2GLS3_LC2G4D4T_MASK                   equ 0080h
CLC2GLS3_G4D1N_POSN                      equ 0000h
CLC2GLS3_G4D1N_POSITION                  equ 0000h
CLC2GLS3_G4D1N_SIZE                      equ 0001h
CLC2GLS3_G4D1N_LENGTH                    equ 0001h
CLC2GLS3_G4D1N_MASK                      equ 0001h
CLC2GLS3_G4D1T_POSN                      equ 0001h
CLC2GLS3_G4D1T_POSITION                  equ 0001h
CLC2GLS3_G4D1T_SIZE                      equ 0001h
CLC2GLS3_G4D1T_LENGTH                    equ 0001h
CLC2GLS3_G4D1T_MASK                      equ 0002h
CLC2GLS3_G4D2N_POSN                      equ 0002h
CLC2GLS3_G4D2N_POSITION                  equ 0002h
CLC2GLS3_G4D2N_SIZE                      equ 0001h
CLC2GLS3_G4D2N_LENGTH                    equ 0001h
CLC2GLS3_G4D2N_MASK                      equ 0004h
CLC2GLS3_G4D2T_POSN                      equ 0003h
CLC2GLS3_G4D2T_POSITION                  equ 0003h
CLC2GLS3_G4D2T_SIZE                      equ 0001h
CLC2GLS3_G4D2T_LENGTH                    equ 0001h
CLC2GLS3_G4D2T_MASK                      equ 0008h
CLC2GLS3_G4D3N_POSN                      equ 0004h
CLC2GLS3_G4D3N_POSITION                  equ 0004h
CLC2GLS3_G4D3N_SIZE                      equ 0001h
CLC2GLS3_G4D3N_LENGTH                    equ 0001h
CLC2GLS3_G4D3N_MASK                      equ 0010h
CLC2GLS3_G4D3T_POSN                      equ 0005h
CLC2GLS3_G4D3T_POSITION                  equ 0005h
CLC2GLS3_G4D3T_SIZE                      equ 0001h
CLC2GLS3_G4D3T_LENGTH                    equ 0001h
CLC2GLS3_G4D3T_MASK                      equ 0020h
CLC2GLS3_G4D4N_POSN                      equ 0006h
CLC2GLS3_G4D4N_POSITION                  equ 0006h
CLC2GLS3_G4D4N_SIZE                      equ 0001h
CLC2GLS3_G4D4N_LENGTH                    equ 0001h
CLC2GLS3_G4D4N_MASK                      equ 0040h
CLC2GLS3_G4D4T_POSN                      equ 0007h
CLC2GLS3_G4D4T_POSITION                  equ 0007h
CLC2GLS3_G4D4T_SIZE                      equ 0001h
CLC2GLS3_G4D4T_LENGTH                    equ 0001h
CLC2GLS3_G4D4T_MASK                      equ 0080h

// Register: CLC3CON
#define CLC3CON CLC3CON
CLC3CON                                  equ 0F20h
// bitfield definitions
CLC3CON_LC3MODE0_POSN                    equ 0000h
CLC3CON_LC3MODE0_POSITION                equ 0000h
CLC3CON_LC3MODE0_SIZE                    equ 0001h
CLC3CON_LC3MODE0_LENGTH                  equ 0001h
CLC3CON_LC3MODE0_MASK                    equ 0001h
CLC3CON_LC3MODE1_POSN                    equ 0001h
CLC3CON_LC3MODE1_POSITION                equ 0001h
CLC3CON_LC3MODE1_SIZE                    equ 0001h
CLC3CON_LC3MODE1_LENGTH                  equ 0001h
CLC3CON_LC3MODE1_MASK                    equ 0002h
CLC3CON_LC3MODE2_POSN                    equ 0002h
CLC3CON_LC3MODE2_POSITION                equ 0002h
CLC3CON_LC3MODE2_SIZE                    equ 0001h
CLC3CON_LC3MODE2_LENGTH                  equ 0001h
CLC3CON_LC3MODE2_MASK                    equ 0004h
CLC3CON_LC3INTN_POSN                     equ 0003h
CLC3CON_LC3INTN_POSITION                 equ 0003h
CLC3CON_LC3INTN_SIZE                     equ 0001h
CLC3CON_LC3INTN_LENGTH                   equ 0001h
CLC3CON_LC3INTN_MASK                     equ 0008h
CLC3CON_LC3INTP_POSN                     equ 0004h
CLC3CON_LC3INTP_POSITION                 equ 0004h
CLC3CON_LC3INTP_SIZE                     equ 0001h
CLC3CON_LC3INTP_LENGTH                   equ 0001h
CLC3CON_LC3INTP_MASK                     equ 0010h
CLC3CON_LC3OUT_POSN                      equ 0005h
CLC3CON_LC3OUT_POSITION                  equ 0005h
CLC3CON_LC3OUT_SIZE                      equ 0001h
CLC3CON_LC3OUT_LENGTH                    equ 0001h
CLC3CON_LC3OUT_MASK                      equ 0020h
CLC3CON_LC3OE_POSN                       equ 0006h
CLC3CON_LC3OE_POSITION                   equ 0006h
CLC3CON_LC3OE_SIZE                       equ 0001h
CLC3CON_LC3OE_LENGTH                     equ 0001h
CLC3CON_LC3OE_MASK                       equ 0040h
CLC3CON_LC3EN_POSN                       equ 0007h
CLC3CON_LC3EN_POSITION                   equ 0007h
CLC3CON_LC3EN_SIZE                       equ 0001h
CLC3CON_LC3EN_LENGTH                     equ 0001h
CLC3CON_LC3EN_MASK                       equ 0080h
CLC3CON_LCMODE0_POSN                     equ 0000h
CLC3CON_LCMODE0_POSITION                 equ 0000h
CLC3CON_LCMODE0_SIZE                     equ 0001h
CLC3CON_LCMODE0_LENGTH                   equ 0001h
CLC3CON_LCMODE0_MASK                     equ 0001h
CLC3CON_LCMODE1_POSN                     equ 0001h
CLC3CON_LCMODE1_POSITION                 equ 0001h
CLC3CON_LCMODE1_SIZE                     equ 0001h
CLC3CON_LCMODE1_LENGTH                   equ 0001h
CLC3CON_LCMODE1_MASK                     equ 0002h
CLC3CON_LCMODE2_POSN                     equ 0002h
CLC3CON_LCMODE2_POSITION                 equ 0002h
CLC3CON_LCMODE2_SIZE                     equ 0001h
CLC3CON_LCMODE2_LENGTH                   equ 0001h
CLC3CON_LCMODE2_MASK                     equ 0004h
CLC3CON_LCINTN_POSN                      equ 0003h
CLC3CON_LCINTN_POSITION                  equ 0003h
CLC3CON_LCINTN_SIZE                      equ 0001h
CLC3CON_LCINTN_LENGTH                    equ 0001h
CLC3CON_LCINTN_MASK                      equ 0008h
CLC3CON_LCINTP_POSN                      equ 0004h
CLC3CON_LCINTP_POSITION                  equ 0004h
CLC3CON_LCINTP_SIZE                      equ 0001h
CLC3CON_LCINTP_LENGTH                    equ 0001h
CLC3CON_LCINTP_MASK                      equ 0010h
CLC3CON_LCOUT_POSN                       equ 0005h
CLC3CON_LCOUT_POSITION                   equ 0005h
CLC3CON_LCOUT_SIZE                       equ 0001h
CLC3CON_LCOUT_LENGTH                     equ 0001h
CLC3CON_LCOUT_MASK                       equ 0020h
CLC3CON_LCOE_POSN                        equ 0006h
CLC3CON_LCOE_POSITION                    equ 0006h
CLC3CON_LCOE_SIZE                        equ 0001h
CLC3CON_LCOE_LENGTH                      equ 0001h
CLC3CON_LCOE_MASK                        equ 0040h
CLC3CON_LCEN_POSN                        equ 0007h
CLC3CON_LCEN_POSITION                    equ 0007h
CLC3CON_LCEN_SIZE                        equ 0001h
CLC3CON_LCEN_LENGTH                      equ 0001h
CLC3CON_LCEN_MASK                        equ 0080h
CLC3CON_LC3MODE_POSN                     equ 0000h
CLC3CON_LC3MODE_POSITION                 equ 0000h
CLC3CON_LC3MODE_SIZE                     equ 0003h
CLC3CON_LC3MODE_LENGTH                   equ 0003h
CLC3CON_LC3MODE_MASK                     equ 0007h

// Register: CLC3POL
#define CLC3POL CLC3POL
CLC3POL                                  equ 0F21h
// bitfield definitions
CLC3POL_LC3G1POL_POSN                    equ 0000h
CLC3POL_LC3G1POL_POSITION                equ 0000h
CLC3POL_LC3G1POL_SIZE                    equ 0001h
CLC3POL_LC3G1POL_LENGTH                  equ 0001h
CLC3POL_LC3G1POL_MASK                    equ 0001h
CLC3POL_LC3G2POL_POSN                    equ 0001h
CLC3POL_LC3G2POL_POSITION                equ 0001h
CLC3POL_LC3G2POL_SIZE                    equ 0001h
CLC3POL_LC3G2POL_LENGTH                  equ 0001h
CLC3POL_LC3G2POL_MASK                    equ 0002h
CLC3POL_LC3G3POL_POSN                    equ 0002h
CLC3POL_LC3G3POL_POSITION                equ 0002h
CLC3POL_LC3G3POL_SIZE                    equ 0001h
CLC3POL_LC3G3POL_LENGTH                  equ 0001h
CLC3POL_LC3G3POL_MASK                    equ 0004h
CLC3POL_LC3G4POL_POSN                    equ 0003h
CLC3POL_LC3G4POL_POSITION                equ 0003h
CLC3POL_LC3G4POL_SIZE                    equ 0001h
CLC3POL_LC3G4POL_LENGTH                  equ 0001h
CLC3POL_LC3G4POL_MASK                    equ 0008h
CLC3POL_LC3POL_POSN                      equ 0007h
CLC3POL_LC3POL_POSITION                  equ 0007h
CLC3POL_LC3POL_SIZE                      equ 0001h
CLC3POL_LC3POL_LENGTH                    equ 0001h
CLC3POL_LC3POL_MASK                      equ 0080h
CLC3POL_G1POL_POSN                       equ 0000h
CLC3POL_G1POL_POSITION                   equ 0000h
CLC3POL_G1POL_SIZE                       equ 0001h
CLC3POL_G1POL_LENGTH                     equ 0001h
CLC3POL_G1POL_MASK                       equ 0001h
CLC3POL_G2POL_POSN                       equ 0001h
CLC3POL_G2POL_POSITION                   equ 0001h
CLC3POL_G2POL_SIZE                       equ 0001h
CLC3POL_G2POL_LENGTH                     equ 0001h
CLC3POL_G2POL_MASK                       equ 0002h
CLC3POL_G3POL_POSN                       equ 0002h
CLC3POL_G3POL_POSITION                   equ 0002h
CLC3POL_G3POL_SIZE                       equ 0001h
CLC3POL_G3POL_LENGTH                     equ 0001h
CLC3POL_G3POL_MASK                       equ 0004h
CLC3POL_G4POL_POSN                       equ 0003h
CLC3POL_G4POL_POSITION                   equ 0003h
CLC3POL_G4POL_SIZE                       equ 0001h
CLC3POL_G4POL_LENGTH                     equ 0001h
CLC3POL_G4POL_MASK                       equ 0008h
CLC3POL_POL_POSN                         equ 0007h
CLC3POL_POL_POSITION                     equ 0007h
CLC3POL_POL_SIZE                         equ 0001h
CLC3POL_POL_LENGTH                       equ 0001h
CLC3POL_POL_MASK                         equ 0080h

// Register: CLC3SEL0
#define CLC3SEL0 CLC3SEL0
CLC3SEL0                                 equ 0F22h
// bitfield definitions
CLC3SEL0_LC3D1S0_POSN                    equ 0000h
CLC3SEL0_LC3D1S0_POSITION                equ 0000h
CLC3SEL0_LC3D1S0_SIZE                    equ 0001h
CLC3SEL0_LC3D1S0_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S0_MASK                    equ 0001h
CLC3SEL0_LC3D1S1_POSN                    equ 0001h
CLC3SEL0_LC3D1S1_POSITION                equ 0001h
CLC3SEL0_LC3D1S1_SIZE                    equ 0001h
CLC3SEL0_LC3D1S1_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S1_MASK                    equ 0002h
CLC3SEL0_LC3D1S2_POSN                    equ 0002h
CLC3SEL0_LC3D1S2_POSITION                equ 0002h
CLC3SEL0_LC3D1S2_SIZE                    equ 0001h
CLC3SEL0_LC3D1S2_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S2_MASK                    equ 0004h
CLC3SEL0_LC3D2S0_POSN                    equ 0004h
CLC3SEL0_LC3D2S0_POSITION                equ 0004h
CLC3SEL0_LC3D2S0_SIZE                    equ 0001h
CLC3SEL0_LC3D2S0_LENGTH                  equ 0001h
CLC3SEL0_LC3D2S0_MASK                    equ 0010h
CLC3SEL0_LC3D2S1_POSN                    equ 0005h
CLC3SEL0_LC3D2S1_POSITION                equ 0005h
CLC3SEL0_LC3D2S1_SIZE                    equ 0001h
CLC3SEL0_LC3D2S1_LENGTH                  equ 0001h
CLC3SEL0_LC3D2S1_MASK                    equ 0020h
CLC3SEL0_LC3D2S2_POSN                    equ 0006h
CLC3SEL0_LC3D2S2_POSITION                equ 0006h
CLC3SEL0_LC3D2S2_SIZE                    equ 0001h
CLC3SEL0_LC3D2S2_LENGTH                  equ 0001h
CLC3SEL0_LC3D2S2_MASK                    equ 0040h
CLC3SEL0_D1S0_POSN                       equ 0000h
CLC3SEL0_D1S0_POSITION                   equ 0000h
CLC3SEL0_D1S0_SIZE                       equ 0001h
CLC3SEL0_D1S0_LENGTH                     equ 0001h
CLC3SEL0_D1S0_MASK                       equ 0001h
CLC3SEL0_D1S1_POSN                       equ 0001h
CLC3SEL0_D1S1_POSITION                   equ 0001h
CLC3SEL0_D1S1_SIZE                       equ 0001h
CLC3SEL0_D1S1_LENGTH                     equ 0001h
CLC3SEL0_D1S1_MASK                       equ 0002h
CLC3SEL0_D1S2_POSN                       equ 0002h
CLC3SEL0_D1S2_POSITION                   equ 0002h
CLC3SEL0_D1S2_SIZE                       equ 0001h
CLC3SEL0_D1S2_LENGTH                     equ 0001h
CLC3SEL0_D1S2_MASK                       equ 0004h
CLC3SEL0_D2S0_POSN                       equ 0004h
CLC3SEL0_D2S0_POSITION                   equ 0004h
CLC3SEL0_D2S0_SIZE                       equ 0001h
CLC3SEL0_D2S0_LENGTH                     equ 0001h
CLC3SEL0_D2S0_MASK                       equ 0010h
CLC3SEL0_D2S1_POSN                       equ 0005h
CLC3SEL0_D2S1_POSITION                   equ 0005h
CLC3SEL0_D2S1_SIZE                       equ 0001h
CLC3SEL0_D2S1_LENGTH                     equ 0001h
CLC3SEL0_D2S1_MASK                       equ 0020h
CLC3SEL0_D2S2_POSN                       equ 0006h
CLC3SEL0_D2S2_POSITION                   equ 0006h
CLC3SEL0_D2S2_SIZE                       equ 0001h
CLC3SEL0_D2S2_LENGTH                     equ 0001h
CLC3SEL0_D2S2_MASK                       equ 0040h
CLC3SEL0_LC3D1S_POSN                     equ 0000h
CLC3SEL0_LC3D1S_POSITION                 equ 0000h
CLC3SEL0_LC3D1S_SIZE                     equ 0003h
CLC3SEL0_LC3D1S_LENGTH                   equ 0003h
CLC3SEL0_LC3D1S_MASK                     equ 0007h
CLC3SEL0_LC3D2S_POSN                     equ 0004h
CLC3SEL0_LC3D2S_POSITION                 equ 0004h
CLC3SEL0_LC3D2S_SIZE                     equ 0003h
CLC3SEL0_LC3D2S_LENGTH                   equ 0003h
CLC3SEL0_LC3D2S_MASK                     equ 0070h

// Register: CLC3SEL1
#define CLC3SEL1 CLC3SEL1
CLC3SEL1                                 equ 0F23h
// bitfield definitions
CLC3SEL1_LC3D3S0_POSN                    equ 0000h
CLC3SEL1_LC3D3S0_POSITION                equ 0000h
CLC3SEL1_LC3D3S0_SIZE                    equ 0001h
CLC3SEL1_LC3D3S0_LENGTH                  equ 0001h
CLC3SEL1_LC3D3S0_MASK                    equ 0001h
CLC3SEL1_LC3D3S1_POSN                    equ 0001h
CLC3SEL1_LC3D3S1_POSITION                equ 0001h
CLC3SEL1_LC3D3S1_SIZE                    equ 0001h
CLC3SEL1_LC3D3S1_LENGTH                  equ 0001h
CLC3SEL1_LC3D3S1_MASK                    equ 0002h
CLC3SEL1_LC3D3S2_POSN                    equ 0002h
CLC3SEL1_LC3D3S2_POSITION                equ 0002h
CLC3SEL1_LC3D3S2_SIZE                    equ 0001h
CLC3SEL1_LC3D3S2_LENGTH                  equ 0001h
CLC3SEL1_LC3D3S2_MASK                    equ 0004h
CLC3SEL1_LC3D4S0_POSN                    equ 0004h
CLC3SEL1_LC3D4S0_POSITION                equ 0004h
CLC3SEL1_LC3D4S0_SIZE                    equ 0001h
CLC3SEL1_LC3D4S0_LENGTH                  equ 0001h
CLC3SEL1_LC3D4S0_MASK                    equ 0010h
CLC3SEL1_LC3D4S1_POSN                    equ 0005h
CLC3SEL1_LC3D4S1_POSITION                equ 0005h
CLC3SEL1_LC3D4S1_SIZE                    equ 0001h
CLC3SEL1_LC3D4S1_LENGTH                  equ 0001h
CLC3SEL1_LC3D4S1_MASK                    equ 0020h
CLC3SEL1_LC3D4S2_POSN                    equ 0006h
CLC3SEL1_LC3D4S2_POSITION                equ 0006h
CLC3SEL1_LC3D4S2_SIZE                    equ 0001h
CLC3SEL1_LC3D4S2_LENGTH                  equ 0001h
CLC3SEL1_LC3D4S2_MASK                    equ 0040h
CLC3SEL1_D3S0_POSN                       equ 0000h
CLC3SEL1_D3S0_POSITION                   equ 0000h
CLC3SEL1_D3S0_SIZE                       equ 0001h
CLC3SEL1_D3S0_LENGTH                     equ 0001h
CLC3SEL1_D3S0_MASK                       equ 0001h
CLC3SEL1_D3S1_POSN                       equ 0001h
CLC3SEL1_D3S1_POSITION                   equ 0001h
CLC3SEL1_D3S1_SIZE                       equ 0001h
CLC3SEL1_D3S1_LENGTH                     equ 0001h
CLC3SEL1_D3S1_MASK                       equ 0002h
CLC3SEL1_D3S2_POSN                       equ 0002h
CLC3SEL1_D3S2_POSITION                   equ 0002h
CLC3SEL1_D3S2_SIZE                       equ 0001h
CLC3SEL1_D3S2_LENGTH                     equ 0001h
CLC3SEL1_D3S2_MASK                       equ 0004h
CLC3SEL1_D4S0_POSN                       equ 0004h
CLC3SEL1_D4S0_POSITION                   equ 0004h
CLC3SEL1_D4S0_SIZE                       equ 0001h
CLC3SEL1_D4S0_LENGTH                     equ 0001h
CLC3SEL1_D4S0_MASK                       equ 0010h
CLC3SEL1_D4S1_POSN                       equ 0005h
CLC3SEL1_D4S1_POSITION                   equ 0005h
CLC3SEL1_D4S1_SIZE                       equ 0001h
CLC3SEL1_D4S1_LENGTH                     equ 0001h
CLC3SEL1_D4S1_MASK                       equ 0020h
CLC3SEL1_D4S2_POSN                       equ 0006h
CLC3SEL1_D4S2_POSITION                   equ 0006h
CLC3SEL1_D4S2_SIZE                       equ 0001h
CLC3SEL1_D4S2_LENGTH                     equ 0001h
CLC3SEL1_D4S2_MASK                       equ 0040h
CLC3SEL1_LC3D3S_POSN                     equ 0000h
CLC3SEL1_LC3D3S_POSITION                 equ 0000h
CLC3SEL1_LC3D3S_SIZE                     equ 0003h
CLC3SEL1_LC3D3S_LENGTH                   equ 0003h
CLC3SEL1_LC3D3S_MASK                     equ 0007h
CLC3SEL1_LC3D4S_POSN                     equ 0004h
CLC3SEL1_LC3D4S_POSITION                 equ 0004h
CLC3SEL1_LC3D4S_SIZE                     equ 0003h
CLC3SEL1_LC3D4S_LENGTH                   equ 0003h
CLC3SEL1_LC3D4S_MASK                     equ 0070h

