GopalSaraf/Practicals/PSDL/include/proc/pic16lf1508.inc
// Register: ICDINSTL
#define ICDINSTL ICDINSTL
ICDINSTL                                 equ 0F96h
// bitfield definitions
ICDINSTL_DBGIN0_POSN                     equ 0000h
ICDINSTL_DBGIN0_POSITION                 equ 0000h
ICDINSTL_DBGIN0_SIZE                     equ 0001h
ICDINSTL_DBGIN0_LENGTH                   equ 0001h
ICDINSTL_DBGIN0_MASK                     equ 0001h
ICDINSTL_DBGIN1_POSN                     equ 0001h
ICDINSTL_DBGIN1_POSITION                 equ 0001h
ICDINSTL_DBGIN1_SIZE                     equ 0001h
ICDINSTL_DBGIN1_LENGTH                   equ 0001h
ICDINSTL_DBGIN1_MASK                     equ 0002h
ICDINSTL_DBGIN2_POSN                     equ 0002h
ICDINSTL_DBGIN2_POSITION                 equ 0002h
ICDINSTL_DBGIN2_SIZE                     equ 0001h
ICDINSTL_DBGIN2_LENGTH                   equ 0001h
ICDINSTL_DBGIN2_MASK                     equ 0004h
ICDINSTL_DBGIN3_POSN                     equ 0003h
ICDINSTL_DBGIN3_POSITION                 equ 0003h
ICDINSTL_DBGIN3_SIZE                     equ 0001h
ICDINSTL_DBGIN3_LENGTH                   equ 0001h
ICDINSTL_DBGIN3_MASK                     equ 0008h
ICDINSTL_DBGIN4_POSN                     equ 0004h
ICDINSTL_DBGIN4_POSITION                 equ 0004h
ICDINSTL_DBGIN4_SIZE                     equ 0001h
ICDINSTL_DBGIN4_LENGTH                   equ 0001h
ICDINSTL_DBGIN4_MASK                     equ 0010h
ICDINSTL_DBGIN5_POSN                     equ 0005h
ICDINSTL_DBGIN5_POSITION                 equ 0005h
ICDINSTL_DBGIN5_SIZE                     equ 0001h
ICDINSTL_DBGIN5_LENGTH                   equ 0001h
ICDINSTL_DBGIN5_MASK                     equ 0020h
ICDINSTL_DBGIN6_POSN                     equ 0006h
ICDINSTL_DBGIN6_POSITION                 equ 0006h
ICDINSTL_DBGIN6_SIZE                     equ 0001h
ICDINSTL_DBGIN6_LENGTH                   equ 0001h
ICDINSTL_DBGIN6_MASK                     equ 0040h
ICDINSTL_DBGIN7_POSN                     equ 0007h
ICDINSTL_DBGIN7_POSITION                 equ 0007h
ICDINSTL_DBGIN7_SIZE                     equ 0001h
ICDINSTL_DBGIN7_LENGTH                   equ 0001h
ICDINSTL_DBGIN7_MASK                     equ 0080h

// Register: ICDINSTH
#define ICDINSTH ICDINSTH
ICDINSTH                                 equ 0F97h
// bitfield definitions
ICDINSTH_DBGIN8_POSN                     equ 0000h
ICDINSTH_DBGIN8_POSITION                 equ 0000h
ICDINSTH_DBGIN8_SIZE                     equ 0001h
ICDINSTH_DBGIN8_LENGTH                   equ 0001h
ICDINSTH_DBGIN8_MASK                     equ 0001h
ICDINSTH_DBGIN9_POSN                     equ 0001h
ICDINSTH_DBGIN9_POSITION                 equ 0001h
ICDINSTH_DBGIN9_SIZE                     equ 0001h
ICDINSTH_DBGIN9_LENGTH                   equ 0001h
ICDINSTH_DBGIN9_MASK                     equ 0002h
ICDINSTH_DBGIN10_POSN                    equ 0002h
ICDINSTH_DBGIN10_POSITION                equ 0002h
ICDINSTH_DBGIN10_SIZE                    equ 0001h
ICDINSTH_DBGIN10_LENGTH                  equ 0001h
ICDINSTH_DBGIN10_MASK                    equ 0004h
ICDINSTH_DBGIN11_POSN                    equ 0003h
ICDINSTH_DBGIN11_POSITION                equ 0003h
ICDINSTH_DBGIN11_SIZE                    equ 0001h
ICDINSTH_DBGIN11_LENGTH                  equ 0001h
ICDINSTH_DBGIN11_MASK                    equ 0008h
ICDINSTH_DBGIN12_POSN                    equ 0004h
ICDINSTH_DBGIN12_POSITION                equ 0004h
ICDINSTH_DBGIN12_SIZE                    equ 0001h
ICDINSTH_DBGIN12_LENGTH                  equ 0001h
ICDINSTH_DBGIN12_MASK                    equ 0010h
ICDINSTH_DBGIN13_POSN                    equ 0005h
ICDINSTH_DBGIN13_POSITION                equ 0005h
ICDINSTH_DBGIN13_SIZE                    equ 0001h
ICDINSTH_DBGIN13_LENGTH                  equ 0001h
ICDINSTH_DBGIN13_MASK                    equ 0020h

// Register: ICDBK0CON
#define ICDBK0CON ICDBK0CON
ICDBK0CON                                equ 0F9Ch
// bitfield definitions
ICDBK0CON_BKHLT_POSN                     equ 0000h
ICDBK0CON_BKHLT_POSITION                 equ 0000h
ICDBK0CON_BKHLT_SIZE                     equ 0001h
ICDBK0CON_BKHLT_LENGTH                   equ 0001h
ICDBK0CON_BKHLT_MASK                     equ 0001h
ICDBK0CON_BKEN_POSN                      equ 0007h
ICDBK0CON_BKEN_POSITION                  equ 0007h
ICDBK0CON_BKEN_SIZE                      equ 0001h
ICDBK0CON_BKEN_LENGTH                    equ 0001h
ICDBK0CON_BKEN_MASK                      equ 0080h

// Register: ICDBK0L
#define ICDBK0L ICDBK0L
ICDBK0L                                  equ 0F9Dh
// bitfield definitions
ICDBK0L_BKA0_POSN                        equ 0000h
ICDBK0L_BKA0_POSITION                    equ 0000h
ICDBK0L_BKA0_SIZE                        equ 0001h
ICDBK0L_BKA0_LENGTH                      equ 0001h
ICDBK0L_BKA0_MASK                        equ 0001h
ICDBK0L_BKA1_POSN                        equ 0001h
ICDBK0L_BKA1_POSITION                    equ 0001h
ICDBK0L_BKA1_SIZE                        equ 0001h
ICDBK0L_BKA1_LENGTH                      equ 0001h
ICDBK0L_BKA1_MASK                        equ 0002h
ICDBK0L_BKA2_POSN                        equ 0002h
ICDBK0L_BKA2_POSITION                    equ 0002h
ICDBK0L_BKA2_SIZE                        equ 0001h
ICDBK0L_BKA2_LENGTH                      equ 0001h
ICDBK0L_BKA2_MASK                        equ 0004h
ICDBK0L_BKA3_POSN                        equ 0003h
ICDBK0L_BKA3_POSITION                    equ 0003h
ICDBK0L_BKA3_SIZE                        equ 0001h
ICDBK0L_BKA3_LENGTH                      equ 0001h
ICDBK0L_BKA3_MASK                        equ 0008h
ICDBK0L_BKA4_POSN                        equ 0004h
ICDBK0L_BKA4_POSITION                    equ 0004h
ICDBK0L_BKA4_SIZE                        equ 0001h
ICDBK0L_BKA4_LENGTH                      equ 0001h
ICDBK0L_BKA4_MASK                        equ 0010h
ICDBK0L_BKA5_POSN                        equ 0005h
ICDBK0L_BKA5_POSITION                    equ 0005h
ICDBK0L_BKA5_SIZE                        equ 0001h
ICDBK0L_BKA5_LENGTH                      equ 0001h
ICDBK0L_BKA5_MASK                        equ 0020h
ICDBK0L_BKA6_POSN                        equ 0006h
ICDBK0L_BKA6_POSITION                    equ 0006h
ICDBK0L_BKA6_SIZE                        equ 0001h
ICDBK0L_BKA6_LENGTH                      equ 0001h
ICDBK0L_BKA6_MASK                        equ 0040h
ICDBK0L_BKA7_POSN                        equ 0007h
ICDBK0L_BKA7_POSITION                    equ 0007h
ICDBK0L_BKA7_SIZE                        equ 0001h
ICDBK0L_BKA7_LENGTH                      equ 0001h
ICDBK0L_BKA7_MASK                        equ 0080h

// Register: ICDBK0H
#define ICDBK0H ICDBK0H
ICDBK0H                                  equ 0F9Eh
// bitfield definitions
ICDBK0H_BKA8_POSN                        equ 0000h
ICDBK0H_BKA8_POSITION                    equ 0000h
ICDBK0H_BKA8_SIZE                        equ 0001h
ICDBK0H_BKA8_LENGTH                      equ 0001h
ICDBK0H_BKA8_MASK                        equ 0001h
ICDBK0H_BKA9_POSN                        equ 0001h
ICDBK0H_BKA9_POSITION                    equ 0001h
ICDBK0H_BKA9_SIZE                        equ 0001h
ICDBK0H_BKA9_LENGTH                      equ 0001h
ICDBK0H_BKA9_MASK                        equ 0002h
ICDBK0H_BKA10_POSN                       equ 0002h
ICDBK0H_BKA10_POSITION                   equ 0002h
ICDBK0H_BKA10_SIZE                       equ 0001h
ICDBK0H_BKA10_LENGTH                     equ 0001h
ICDBK0H_BKA10_MASK                       equ 0004h
ICDBK0H_BKA11_POSN                       equ 0003h
ICDBK0H_BKA11_POSITION                   equ 0003h
ICDBK0H_BKA11_SIZE                       equ 0001h
ICDBK0H_BKA11_LENGTH                     equ 0001h
ICDBK0H_BKA11_MASK                       equ 0008h
ICDBK0H_BKA12_POSN                       equ 0004h
ICDBK0H_BKA12_POSITION                   equ 0004h
ICDBK0H_BKA12_SIZE                       equ 0001h
ICDBK0H_BKA12_LENGTH                     equ 0001h
ICDBK0H_BKA12_MASK                       equ 0010h
ICDBK0H_BKA13_POSN                       equ 0005h
ICDBK0H_BKA13_POSITION                   equ 0005h
ICDBK0H_BKA13_SIZE                       equ 0001h
ICDBK0H_BKA13_LENGTH                     equ 0001h
ICDBK0H_BKA13_MASK                       equ 0020h
ICDBK0H_BKA14_POSN                       equ 0006h
ICDBK0H_BKA14_POSITION                   equ 0006h
ICDBK0H_BKA14_SIZE                       equ 0001h
ICDBK0H_BKA14_LENGTH                     equ 0001h
ICDBK0H_BKA14_MASK                       equ 0040h

// Register: BSRICDSHAD
#define BSRICDSHAD BSRICDSHAD
BSRICDSHAD                               equ 0FE3h
// bitfield definitions
BSRICDSHAD_BSR_ICDSHAD_POSN              equ 0000h
BSRICDSHAD_BSR_ICDSHAD_POSITION          equ 0000h
BSRICDSHAD_BSR_ICDSHAD_SIZE              equ 0005h
BSRICDSHAD_BSR_ICDSHAD_LENGTH            equ 0005h
BSRICDSHAD_BSR_ICDSHAD_MASK              equ 001Fh

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

